IRP/src/InformationRegisters/ExpenseRevenueTypeSettings/ExpenseRevenueTypeSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>ExpenseRevenueTypeSettings</name>
 <resources>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </resources>
 <resources>
  <name>RevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemType</name>
  <type>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/ExpenseAndRevenueTypes/ExpenseAndRevenueTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ExpenseAndRevenueTypes</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>IsExpense</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsRevenue</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsFinancialMovementType</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ExpenseType</name>
  <type>
   <types>EnumRef.ExpenseTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Specification</name>
  <type>
   <types>CatalogRef.Specifications</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultBillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </attributes>
 <attributes>
  <name>UseIncomingStockReservation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecificationAffectPricingMD5</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricingMD5</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Items</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>ItemType</name>
  <type>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>MainPricture</name>
  <comment>Temporary</comment>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>Vendor</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>ControlCodeString</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckCodeString</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ControlCodeStringType</name>
  <type>
   <types>EnumRef.ControlCodeStringType</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/ExpenseRevenueTypeSettings/ManagerModule.bsl
// @strict-types

// Get expense type.
// 
// Parameters:
//  Filter - see GetFilter
// 
// Returns:
//  CatalogRef.ExpenseAndRevenueTypes
Function GetExpenseType(Filter) Export

	ExpenseType = Catalogs.ExpenseAndRevenueTypes.EmptyRef();
	ERType = GetERType(Filter);
	If ERType.Count() Then
		ExpenseType = ERType[0].ExpenseType;
	EndIf;
	
	Return ExpenseType;

EndFunction

// Get revenue type.
// 
// Parameters:
//  Filter - see GetFilter
// 
// Returns:
//  CatalogRef.ExpenseAndRevenueTypes
Function GetRevenueType(Filter) Export

	RevenueType = Catalogs.ExpenseAndRevenueTypes.EmptyRef();
	ERType = GetERType(Filter);
	If ERType.Count() Then
		RevenueType = ERType[0].RevenueType;
	EndIf;
	
	Return RevenueType;

EndFunction

// Get ERType.
// 
// Parameters:
//  Filter - see GetFilter
// 
// Returns:
//  ValueTable - Get ERType:
//  	*ExpenseType - CatalogRef.ExpenseAndRevenueTypes
//  	*RevenueType - CatalogRef.ExpenseAndRevenueTypes
Function GetERType(Filter)

	Query = New Query;
	Query.Text =
		"SELECT ALLOWED
		|	ERTS.ExpenseType,
		|	ERTS.RevenueType,
		|	CASE
		|		When ERTS.ItemKey = &ItemKey
		|		And Not ERTS.ItemKey = Value(Catalog.ItemKeys.EmptyRef)
		|			Then 1000
		|		Else 0
		|	END AS ItemKeyPart,
		|	CASE
		|		When ERTS.Item = &Item
		|		And Not ERTS.Item = Value(Catalog.Items.EmptyRef)
		|			Then 100
		|		Else 0
		|	END AS ItemPart,
		|	CASE
		|		When ERTS.ItemType = &ItemType
		|		And Not ERTS.ItemType = Value(Catalog.ItemTypes.EmptyRef)
		|			Then 10
		|		Else 0
		|	END AS ItemTypePart,
		|	CASE
		|		When ERTS.ItemType = Value(Catalog.ItemTypes.EmptyRef)
		|		AND ERTS.Item = Value(Catalog.Items.EmptyRef)
		|		AND ERTS.ItemKey = Value(Catalog.ItemKeys.EmptyRef)
		|			Then 1
		|		Else 0
		|	END AS CompanyPart
		|INTO VT
		|FROM
		|	InformationRegister.ExpenseRevenueTypeSettings AS ERTS
		|WHERE
		|	ERTS.Company = &Company
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	VT.ExpenseType,
		|	VT.RevenueType,
		|	VT.ItemKeyPart + VT.ItemPart + VT.ItemTypePart + VT.CompanyPart AS Priority
		|FROM
		|	VT AS VT
		|WHERE
		|	VT.ItemKeyPart + VT.ItemPart + VT.ItemTypePart + VT.CompanyPart > 0
		|
		|ORDER BY
		|	Priority DESC";
	
	Query.SetParameter("Item", Filter.Item);
	Query.SetParameter("Company", Filter.Company);
	Query.SetParameter("ItemType", Filter.ItemType);
	Query.SetParameter("ItemKey", Filter.ItemKey);
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	Return QueryTable;
EndFunction

// Get filter.
// 
// Returns:
//  Structure - Get filter:
// * Company - CatalogRef.Companies -
// * ItemKey - CatalogRef.ItemKeys -
// * Item - CatalogRef.Items -
// * ItemType - CatalogRef.ItemTypes -
Function GetFilter() Export
	
	Str = New Structure;
	Str.Insert("Company", Catalogs.Companies.EmptyRef());
	Str.Insert("ItemKey", Catalogs.ItemKeys.EmptyRef());
	Str.Insert("Item", Catalogs.Items.EmptyRef());
	Str.Insert("ItemType", Catalogs.ItemTypes.EmptyRef());
	
	Return Str;

EndFunction

#Region AccessObject

// Get access key.
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion
